src/Documents/ПриказОКомпенсацииСверхурочнойРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПриказОКомпенсацииСверхурочнойРаботы</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостояниеРаботниковОрганизаций</xr:Item>
				<xr:Item>AccumulationRegister.ВнутрисменноеВремяРаботниковОрганизаций</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКадровогоПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НочныеЧасы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственнаяНеобходимость</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиректорПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрисконсультПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РаботникиОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГрафикРаботы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплачиватьВОдинарномРазмере</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньОтдыха</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НочныхЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяС</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПо</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯвкаВТабель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/РаботникиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РаботникиОрганизаций</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗанимаемыхСтавокЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбособленноеПодразделениеЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеОрганизацииЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДолжностьЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрафикРаботыЗавершения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостояния</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаИзмененияСостоянияЗавершения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныИзмененияСостояния</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрядЕТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышенныйКоэффициентЕТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИтоговоеПовышениеПоИнструкции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Временно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТарифнаяСтавкаПервогоРазряда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеСтавкиПервогоРазряда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловияТрудаИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДеятельностиИзмерение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобыеУсловияТруда</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БезЕТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкладВВалюте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДляПечати</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсключитьИзПУ2</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ауМестоРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СЭ_МестаРаботы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВременныйПереводКлимовичи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбособленноеПодразделениеРБ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипРаботникаУдалить</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРаботников</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьСотрудникЗаменяемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/AccumulationRegisters/ВнутрисменноеВремяРаботниковОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВнутрисменноеВремяРаботниковОрганизаций</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Часов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидИспользованияРабочегоВремени</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторИспользованияРабочегоВремени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ПриказОКомпенсацииСверхурочнойРаботы/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОКУМЕНТА

#Если ТолстыйКлиентОбычноеПриложение Тогда

// Процедура осуществляет печать документа. Можно направить печать на 
// экран или принтер, а также распечатать необходмое количество копий.
//
// Название макета печати передается в качестве параметра,
// по переданному названию находим имя макета в соответствии.
//
// Параметры:
//	НазваниеМакета - строка, название макета.
//
Функция Печать(ИмяМакета, КоличествоЭкземпляров = 1, НаПринтер = Ложь) Экспорт
	
	ТабДокумент = Неопределено;
	
	// Получить экземпляр документа на печать
	ИмяФормы = "";
	Если ИмяМакета = "Приказ" Тогда
		СпрХранилище = Справочники.ХранилищеДополнительнойИнформации;
		ИскомыйПриказ = СпрХранилище.НайтиПоРеквизиту("Объект",Ссылка);
		Если УчетВремениСвэй.обПустоеЗначение(ИскомыйПриказ) Тогда
			//Если Не УчетВремениСвэй.обВнешняяПечатьДокумента(ЭтотОбъект, "КадровыйПриказ") Тогда
				//Обработка = Обработки.ПечатьКадровыхПриказов.Создать();
				//Обработка.ЗаполнитьПараметры(ЭтотОбъект);
				//Обработка.Печать("КадровыйПриказ");
			//КонецЕсли;
			ТабДокумент = ПечатьПриказ(ИмяМакета);
		Иначе
			ФайлПриказа = ИскомыйПриказ.Хранилище.Получить();
			РаботаСФайлами.ОткрытьФайлИзХранилища(ИскомыйПриказ.Наименование,ИскомыйПриказ.Хранилище,"",истина);
		//	ОжидатьЗакрытияФайлаИОбновитьПрикрепленныйФайл(КаталогВременныхФайлов()+ИскомыйПриказ.Наименование, ИскомыйПриказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РаботаСДиалогами.НапечататьДокумент(ТабДокумент, КоличествоЭкземпляров, НаПринтер, РаботаСДиалогами.СформироватьЗаголовокДокумента(ЭтотОбъект,Метаданные().Синоним + ИмяФормы));
	
КонецФункции // Печать()

//(начало) добавлено Кухарчуком Д.Я. 22.08.18, Задача СВФР-002063
// Функция формирует табличный документ с печатной формой "Т-6а",
//
// Возвращаемое значение:
//	Табличный документ - печатная форма
//
Функция ПечатьПриказ(ИмяМакета = "")

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	//ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ОтпускаОрганизации_Т6а";
	
	Запрос =  Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапроса();    	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Документ", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	
	// подсчитываем количество страниц документа - для корректного разбиения на страницы
	ВсегоСтрокДокумента = Выборка.Количество();
	
	// запоминаем области макета
	Макет = ПолучитьМакет("Приказ");
	ОбластьМакетаШапка = Макет.ПолучитьОбласть("Шапка"); // Шапка документа.
	ПовторятьПриПечатиСтроки = Макет.ПолучитьОбласть("ПовторятьПриПечати"); // повторяющаяся шапка страницы
	ОбластьМакетаПодвал = Макет.ПолучитьОбласть("Подвал");// Подвал документа
	ОбластьМакетаСтрока = Макет.ПолучитьОбласть("Строка"); // строка работника
	
	// массив с двумя строками - для разбиения на страницы
	ВыводимыеОбласти = Новый Массив();
	ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
	
	ОтветственныеЛица = РегламентированнаяОтчетность.ОтветственныеЛицаОрганизаций(Организация, Дата);
	Руководитель =  ОтветственныеЛица.Руководитель;
	ОбластьМакетаПодвал.Параметры.ДолжностьРуководителя = ТРег(ОтветственныеЛица.РуководительДолжность);
//	ФИО = ОбщегоНазначения.ФамилияИнициалыФизЛица(Руководитель);
	ОбластьМакетаПодвал.Параметры.Руководитель = Руководитель; 
	
	ОбластьМакетаШапка.Параметры.Организация = СокрЛП(Организация.НаименованиеПолное);
	ОбластьМакетаШапка.Параметры.Дата = Формат(Дата,"ДЛФ=Д");
	Если СокрЛП(НомерКадровогоПриказа) <> "" Тогда 
		ОбластьМакетаШапка.Параметры.Номер = НомерКадровогоПриказа;
	Иначе 		
		ОбластьМакетаШапка.Параметры.Номер = Номер;
	КонецЕсли;
	
//	ОбластьМакетаШапка.Параметры.Город = Обработки.ПечатьКадровыхПриказов.Создать().ПолучитГородОрганизации(Организация);		
	
	//Попытка
	//	ДатаПраздника = Формат(РаботникиОрганизации[0].ДатаВыхода,"ДЛФ=Д");
	//Исключение
	//	ДатаПраздника = Дата;		
	//КонецПопытки;
	
	//ТекстПриказываю = Символы.Таб + "1. Привлечь к работе в праздничный(выходной) день " + Формат(ДатаПраздника,"ДЛФ=Д") + 
	//" следующих сотрудников " + Организация + " с их согласия:";
	
	ТекстПриказываю = Символы.Таб + "1. Компенсипровать сверхурочную работу " + 
	" следующих сотрудников " + Организация + " :";
	ОбластьМакетаШапка.Параметры.ТекстПриказа = Ссылка.Комментарий; //Ссылка.СодержаниеПриказа
	ОбластьМакетаШапка.Параметры.ТекстПриказываю = ТекстПриказываю;	
	
	// Начинаем формировать выходной документ
	ТабДокумент.Вывести(ОбластьМакетаШапка); // Шапка документа.
	ВыведеноСтрок = 0;
	ПредПодразделение  = "";
	Если ВсегоСтрокДокумента <> 0 Тогда
		// выводим строки по работникам
		Пока Выборка.Следующий() Цикл
			Если ИмяМакета = "ПриказПоПодразделениям" Тогда 
				Если ПредПодразделение <> СокрЛП(Выборка.ПодразделениеОрганизации.Наименование) Тогда 
					ОбластьМакетаПодразделение = Макет.ПолучитьОбласть("Подразделение"); 
					ОбластьМакетаПодразделение.Параметры.Подразделение = СокрЛП(Выборка.ПодразделениеОрганизации.Наименование);
					ТабДокумент.Вывести(ОбластьМакетаПодразделение);
					ПредПодразделение = СокрЛП(Выборка.ПодразделениеОрганизации.Наименование);
				КонецЕсли;			
			КонецЕсли;
			ОбластьМакетаСтрока.Параметры.Заполнить(Выборка);
			// разбиение на страницы
			ВыведеноСтрок = ВыведеноСтрок + 1;
			
			// Проверим, уместится ли строка на странице или надо открывать новую страницу
			ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			Если Не ВывестиПодвалЛиста и ВыведеноСтрок = ВсегоСтрокДокумента Тогда
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
				ВывестиПодвалЛиста = Не ТабДокумент.ПроверитьВывод(ВыводимыеОбласти);
			КонецЕсли;
			Если ВывестиПодвалЛиста Тогда
				ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабДокумент.Вывести(ПовторятьПриПечатиСтроки);
			КонецЕсли;
			ОбластьМакетаСтрока.Параметры.Номер = ВыведеноСтрок;
			ОбластьМакетаСтрока.Параметры.Должность = ?( ЗначениеЗаполнено(Выборка.Должность), СокрЛП(Выборка.Должность.Наименование), "");
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
		КонецЦикла;
	Иначе
		// если не было ни одного работника - выводим пустой бланк
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		Для Сч = 1 По ОбластьМакетаСтрока.Параметры.Количество() Цикл
			ОбластьМакетаСтрока.Параметры.Установить(Сч - 1,""); 
		КонецЦикла;
		ОбластьМакетаСтрока.Параметры.Сотрудник = " " + Символы.ПС + " ";
		Пока ТабДокумент.ПроверитьВывод(ВыводимыеОбласти) Цикл
			ТабДокумент.Вывести(ОбластьМакетаСтрока);
		КонецЦикла;
	КонецЕсли;
	// выводим предварительно подготовленный Подвал документа.
	ТабДокумент.Вывести(ОбластьМакетаПодвал);
	
	Возврат ТабДокумент;
	
КонецФункции 


Функция ПолучитьТекстЗапроса()
	Текст = 
	"ВЫБРАТЬ
	|	ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.Сотрудник,
	|	ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.Дата КАК ДатаВыхода,
	|	ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.Физлицо,
	|	ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.Дата КАК ДеньОтдыха,
	|	ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.ОплачиватьВОдинарномРазмере,
	|	ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.ОтработаноЧасов
	|ПОМЕСТИТЬ ВТСотрудникиДокумента
	|ИЗ
	|	Документ.ПриказОКомпенсацииСверхурочнойРаботы.РаботникиОрганизации КАК ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации
	|ГДЕ
	|	ПриказНаРаботуВПраздничныеИВыходныеДниРаботникиОрганизации.Ссылка = &Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСотрудникиДокумента.Сотрудник,
	|	ВТСотрудникиДокумента.ДатаВыхода,
	|	ВТСотрудникиДокумента.ОплачиватьВОдинарномРазмере,
	|	ВТСотрудникиДокумента.ОтработаноЧасов,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|				И РаботникиОрганизаций.ПериодЗавершения <= ВТСотрудникиДокумента.ДатаВыхода
	|			ТОГДА РаботникиОрганизаций.ПодразделениеОрганизацииЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ПодразделениеОрганизации
	|	КОНЕЦ КАК ПодразделениеОрганизации,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	|				И РаботникиОрганизаций.ПериодЗавершения <= ВТСотрудникиДокумента.ДатаВыхода
	|			ТОГДА РаботникиОрганизаций.ДолжностьЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.Должность
	|	КОНЕЦ КАК Должность,
	//|	ВЫБОР
	//|		КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	//|				И РаботникиОрганизаций.ПериодЗавершения <= ВТСотрудникиДокумента.ДатаВыхода
	//|			ТОГДА РаботникиОрганизаций.ДолжностьПодразделенияЗавершения
	//|		ИНАЧЕ РаботникиОрганизаций.ДолжностьПодразделения
	//|	КОНЕЦ КАК ДолжностьПодразделения,
	//|	ВЫБОР
	//|		КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	//|				И РаботникиОрганизаций.ПериодЗавершения <= ВТСотрудникиДокумента.ДатаВыхода
	//|			ТОГДА РаботникиОрганизаций.РазрядПоЕТСЗавершения
	//|		ИНАЧЕ РаботникиОрганизаций.РазрядПоЕТС
	//|	КОНЕЦ КАК РазрядПоЕТС,
	//|	ВЫБОР
	//|		КОГДА ВЫБОР
	//|				КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1)
	//|						И РаботникиОрганизаций.ПериодЗавершения <= ВТСотрудникиДокумента.ДатаВыхода
	//|					ТОГДА РаботникиОрганизаций.ДолжностьЗавершения.КатегорияСтатистическогоУчета.КатегорияДляСтатистическогоУчета
	//|				ИНАЧЕ РаботникиОрганизаций.Должность.КатегорияСтатистическогоУчета.КатегорияДляСтатистическогоУчета
	//|			КОНЕЦ = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейДляСтатистическогоУчета.Рабочие)
	//|			ТОГДА ИСТИНА
	//|		ИНАЧЕ ЛОЖЬ
	//|	КОНЕЦ КАК ЭтоРазряд,
	|	ВЫБОР
	|		КОГДА РаботникиОрганизаций.ПериодЗавершения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				И РаботникиОрганизаций.ПериодЗавершения <= ВТСотрудникиДокумента.ДатаВыхода
	|			ТОГДА РаботникиОрганизаций.ЗанимаемыхСтавокЗавершения
	|		ИНАЧЕ РаботникиОрганизаций.ЗанимаемыхСтавок
	|	КОНЕЦ КАК ЗанимаемыхСтавок
	|ПОМЕСТИТЬ ВТРаботникиСДолжностями
	|ИЗ
	|	ВТСотрудникиДокумента КАК ВТСотрудникиДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТСотрудникиДокумента.Сотрудник КАК Сотрудник,
	|			МАКСИМУМ(РаботникиОрганизаций.Период) КАК Период
	|		ИЗ
	|			ВТСотрудникиДокумента КАК ВТСотрудникиДокумента
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|				ПО ВТСотрудникиДокумента.Сотрудник = РаботникиОрганизаций.Сотрудник
	|					И ВТСотрудникиДокумента.ДатаВыхода >= РаботникиОрганизаций.Период
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТСотрудникиДокумента.Сотрудник) КАК МаксимальныеДатыВРегистреРаботники
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РаботникиОрганизаций КАК РаботникиОрганизаций
	|			ПО МаксимальныеДатыВРегистреРаботники.Сотрудник = РаботникиОрганизаций.Сотрудник
	|				И МаксимальныеДатыВРегистреРаботники.Период = РаботникиОрганизаций.Период
	|		ПО ВТСотрудникиДокумента.Сотрудник = МаксимальныеДатыВРегистреРаботники.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРаботникиСДолжностями.Сотрудник,
	|	ВТРаботникиСДолжностями.ДатаВыхода,
	|	ВТРаботникиСДолжностями.ОплачиватьВОдинарномРазмере,
	|	ВТРаботникиСДолжностями.ОтработаноЧасов,
	|	ВТРаботникиСДолжностями.ПодразделениеОрганизации,
	|	ВТРаботникиСДолжностями.Должность,
	//|	ВТРаботникиСДолжностями.ДолжностьПодразделения,
	//|	ВТРаботникиСДолжностями.ЭтоРазряд,
	//|	ВТРаботникиСДолжностями.РазрядПоЕТС,
	//|	ВЫБОР
	//|		КОГДА ВТРаботникиСДолжностями.Должность.КатегорияСтатистическогоУчета.КатегорияДляСтатистическогоУчета = ЗНАЧЕНИЕ(Перечисление.КатегорииДолжностейДляСтатистическогоУчета.Рабочие)
	//|			ТОГДА ВТРаботникиСДолжностями.РазрядПоЕТС
	//|		ИНАЧЕ ВЫБОР
	//|				КОГДА ШтатноеРасписаниеОрганизаций.КатегорияШР ЕСТЬ НЕ NULL 
	//|					ТОГДА ШтатноеРасписаниеОрганизаций.КатегорияШР.Наименование
	//|				ИНАЧЕ """"""""
	//|			КОНЕЦ
	//|	КОНЕЦ КАК РазрядИЛИКатегория,
	|	ВТРаботникиСДолжностями.ЗанимаемыхСтавок
	|ПОМЕСТИТЬ ВТРаботникиСКатегориями
	|ИЗ
	|	ВТРаботникиСДолжностями КАК ВТРаботникиСДолжностями
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТРаботникиСДолжностями.Сотрудник КАК Сотрудник,
	|			МАКСИМУМ(ШтатноеРасписаниеОрганизаций.Период) КАК Период,
	|			ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации КАК ПодразделениеОрганизации,
	|			ШтатноеРасписаниеОрганизаций.Должность КАК Должность
	//|			ШтатноеРасписаниеОрганизаций.ДолжностьПодразделения КАК ДолжностьПодразделения
	|		ИЗ
	|			ВТРаботникиСДолжностями КАК ВТРаботникиСДолжностями
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписаниеОрганизаций
	|				ПО ВТРаботникиСДолжностями.ПодразделениеОрганизации = ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации
	|					И ВТРаботникиСДолжностями.Должность = ШтатноеРасписаниеОрганизаций.Должность
	//|					И ВТРаботникиСДолжностями.ДолжностьПодразделения = ШтатноеРасписаниеОрганизаций.ДолжностьПодразделения
	|					И ВТРаботникиСДолжностями.ДатаВыхода >= ШтатноеРасписаниеОрганизаций.Период
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТРаботникиСДолжностями.Сотрудник,
	|			ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации,
	|			ШтатноеРасписаниеОрганизаций.Должность) КАК МаксимальныеДатыШтатного
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтатноеРасписаниеОрганизаций КАК ШтатноеРасписаниеОрганизаций
	|			ПО МаксимальныеДатыШтатного.ПодразделениеОрганизации = ШтатноеРасписаниеОрганизаций.ПодразделениеОрганизации
	|				И МаксимальныеДатыШтатного.Должность = ШтатноеРасписаниеОрганизаций.Должность
	//|				И МаксимальныеДатыШтатного.ДолжностьПодразделения = ШтатноеРасписаниеОрганизаций.ДолжностьПодразделения
	|				И МаксимальныеДатыШтатного.Период = ШтатноеРасписаниеОрганизаций.Период
	|		ПО ВТРаботникиСДолжностями.Сотрудник = МаксимальныеДатыШтатного.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРаботникиСКатегориями.Сотрудник,
	|	ВТРаботникиСКатегориями.ДатаВыхода,
	|	ВТРаботникиСКатегориями.ОплачиватьВОдинарномРазмере,
	|	ВТРаботникиСКатегориями.ОтработаноЧасов,
	|	ВТРаботникиСКатегориями.ПодразделениеОрганизации,
	|	ВТРаботникиСКатегориями.Должность,
	//|	ВТРаботникиСКатегориями.ДолжностьПодразделения,
	//|	ВТРаботникиСКатегориями.ЭтоРазряд,
	//|	ВТРаботникиСКатегориями.РазрядПоЕТС,
	//|	ВТРаботникиСКатегориями.РазрядИЛИКатегория,
	|	ВЫБОР
	|		КОГДА ФИОФизЛиц.ФизЛицо ЕСТЬ NULL 
	|				ИЛИ ФИОФизЛиц.Фамилия = """"
	|			ТОГДА ВТРаботникиСКатегориями.Сотрудник.Физлицо.Наименование
	|		ИНАЧЕ ФИОФизЛиц.Фамилия + "" "" + ФИОФизЛиц.Имя + "" "" + ФИОФизЛиц.Отчество
	|	КОНЕЦ КАК ФИО,
	|	ВТРаботникиСКатегориями.Сотрудник.Физлицо КАК Физлицо,
	|	ВТРаботникиСКатегориями.Сотрудник.Физлицо.Пол КАК Пол,
	|	ВТРаботникиСКатегориями.ЗанимаемыхСтавок
	|ИЗ
	|	ВТРаботникиСКатегориями КАК ВТРаботникиСКатегориями
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТРаботникиСКатегориями.Сотрудник КАК Сотрудник,
	|			МАКСИМУМ(ФИОФизЛиц.Период) КАК Период
	|		ИЗ
	|			ВТРаботникиСКатегориями КАК ВТРаботникиСКатегориями
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц КАК ФИОФизЛиц
	|				ПО ВТРаботникиСКатегориями.Сотрудник.Физлицо = ФИОФизЛиц.ФизЛицо
	|					И ВТРаботникиСКатегориями.ДатаВыхода >= ФИОФизЛиц.Период
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТРаботникиСКатегориями.Сотрудник) КАК МаксимальныеДатыФИО
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизЛиц КАК ФИОФизЛиц
	|			ПО МаксимальныеДатыФИО.Сотрудник.Физлицо = ФИОФизЛиц.ФизЛицо
	|				И МаксимальныеДатыФИО.Период = ФИОФизЛиц.Период
	|		ПО ВТРаботникиСКатегориями.Сотрудник = МаксимальныеДатыФИО.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТРаботникиСКатегориями.ПодразделениеОрганизации.Наименование,
	|	ФИО";	
	Возврат Текст;
КонецФункции 

//(конец) добавлено Кухарчуком Д.Я. 22.08.18, Задача СВФР-002063

#КонецЕсли

// Возвращает доступные варианты печати документа
//
// Вовращаемое значение:
//	Струткура, каждая строка которой соответствует одному из вариантов печати
//
Функция ПолучитьСтруктуруПечатныхФорм() Экспорт
	
	СтруктураМакетов = Новый Структура;
	СтруктураМакетов.Вставить("Приказ",	   "Приказ");	
		
	Возврат СтруктураМакетов;

КонецФункции // ПолучитьСтруктуруПечатныхФорм()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ ОБЕСПЕЧЕНИЯ ПРОВЕДЕНИЯ ДОКУМЕНТА

// Формирует запрос по шапке документа
//
// Параметры:
//	Режим	- режим проведения
//
// Возвращаемое значение:
//	Результат запроса
//
Функция СформироватьЗапросПоШапке(Режим)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка" , Ссылка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриказОКомпенсацииСверхурочнойРаботы.Дата,
	|	ПриказОКомпенсацииСверхурочнойРаботы.Организация КАК ОбособленноеПодразделение,
	|	ВЫБОР
	|		КОГДА ПриказОКомпенсацииСверхурочнойРаботы.Организация.ГоловнаяОрганизация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|			ТОГДА ПриказОКомпенсацииСверхурочнойРаботы.Организация
	|		ИНАЧЕ ПриказОКомпенсацииСверхурочнойРаботы.Организация.ГоловнаяОрганизация
	|	КОНЕЦ КАК ГоловнаяОрганизация,
	|	ПриказОКомпенсацииСверхурочнойРаботы.Ссылка
	|ИЗ
	|	Документ.ПриказОКомпенсацииСверхурочнойРаботы КАК ПриказОКомпенсацииСверхурочнойРаботы
	|ГДЕ
	|	ПриказОКомпенсацииСверхурочнойРаботы.Ссылка = &ДокументСсылка";

	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоШапке()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизтов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по шапке,
// все проверяемые реквизиты должны быть включены в выборку по шапке.
//
// Параметры: 
//	ВыборкаПоШапкеДокумента	- выборка из результата запроса по шапке документа,
//	Отказ					- флаг отказа в проведении,
//	Заголовок				- Заголовок для сообщений об ошибках проведения.
//
Процедура ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок)

	Если НЕ ЗначениеЗаполнено(ВыборкаПоШапкеДокумента.ОбособленноеПодразделение) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указана организация, для которой ведется учет!", Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапки()

// Формирует запрос по таблице "РаботникиОрганизации" документа
//
// Параметры:
//	Режим - режим проведения
//
// Возвращаемое значение:
//	Результат запроса.
//
Функция СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента)

	Запрос = Новый Запрос;

	// Установим параметры запроса
	Запрос.УстановитьПараметр("ДокументСсылка", Ссылка);
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ВыборкаПоШапкеДокумента.ГоловнаяОрганизация);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Ссылка,
	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.НомерСтроки,
	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Сотрудник,
	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.ФизЛицо,
	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.ПодразделениеОрганизации,
	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Должность,
	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.ГрафикРаботы,
	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Дата,
	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.ОтработаноЧасов,
	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.ОплачиватьВОдинарномРазмере,
	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.ДеньОтдыха, //Аверсон 25.01.2021 КВВ СВФР-007084
	|	ВЫБОР
	|		КОГДА ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Сотрудник.Организация = &ГоловнаяОрганизация
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОшибкаНеСоответствиеСотрудникаИОрганизации,
	|	ЗНАЧЕНИЕ(Справочник.КлассификаторИспользованияРабочегоВремени.Сверхурочные) КАК ВидИспользованияРабочегоВремени,
	
	//Аверсон ЕАЕ 05.08.2025 СВФР-016362
	|   ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.ВремяС,
	|   ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.ВремяПо
	//Аверсон СВФР-016362
	
	|ИЗ
	|	Документ.ПриказОКомпенсацииСверхурочнойРаботы.РаботникиОрганизации КАК ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации
	|ГДЕ
	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Ссылка = &ДокументСсылка";
	
	Возврат Запрос.Выполнить();

КонецФункции // СформироватьЗапросПоРаботникиОрганизации()

// Проверяет правильность заполнения реквизитов в строке ТЧ "РаботникиОрганизации" документа.
// Если какой-то из реквизтов, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверка выполняется по выборке из результата запроса по строке ТЧ документа,
// все проверяемые реквизиты должны быть включены в выборку.
//
// Параметры:
//	ВыборкаПоШапкеДокумента		- выборка из результата запроса по шапке документа,
//	ВыборкаПоСтрокамДокумента	- спозиционированная на определенной строке выборка 
//								  из результата запроса по товарам документа, 
//	Отказ 						- флаг отказа в проведении.
//
Процедура ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаПоСтрокамДокумента, Отказ, Заголовок)

	СтрокаНачалаСообщенияОбОшибке = "В строке номер """+ СокрЛП(ВыборкаПоСтрокамДокумента.НомерСтроки) +
									""" табл. части ""Работники организации"": ";

	// Сотрудник
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Сотрудник) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не выбран сотрудник!", Отказ, Заголовок);
	КонецЕсли;
	
	// Организация сотрудника должна совпадать с организацией документа
	Если ВыборкаПоСтрокамДокумента.ОшибкаНеСоответствиеСотрудникаИОрганизации Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "указанный сотрудник оформлен на другую организацию!", Отказ, Заголовок);
	КонецЕсли;
	
	// Дата
	Если НЕ ЗначениеЗаполнено(ВыборкаПоСтрокамДокумента.Дата) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указана дата сверхурочной работы!", Отказ, Заголовок);
	КонецЕсли;
	
	// ОтработаноЧасов
	Если ВыборкаПоСтрокамДокумента.ОтработаноЧасов=0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке(СтрокаНачалаСообщенияОбОшибке + "не указано часов сверурочной работы!", Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеСтрокиРаботникаОрганизации()

// По строке выборки результата запроса по документу формируем движения по регистрам
//
// Параметры:
//	ВыборкаПоШапкеДокумента					- выборка из результата запроса по шапке документа,
//	СтруктураПроведенияПоРегистрамСведений	- структура, содержащая имена регистров 
//											  сведений по которым надо проводить документ,
//	СтруктураПараметров						- структура параметров проведения,
//
// Возвращаемое значение:
//	Нет.
//
Процедура ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаПоРаботникиОрганизации)

	Движение = Движения.ВнутрисменноеВремяРаботниковОрганизаций.Добавить();
	// Свойства
	Движение.Период = ВыборкаПоРаботникиОрганизации.Дата;
	// Измерения
	Движение.Сотрудник							= ВыборкаПоРаботникиОрганизации.Сотрудник;
	Движение.Организация						= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	Движение.ВидИспользованияРабочегоВремени	= ВыборкаПоРаботникиОрганизации.ВидИспользованияРабочегоВремени;
	// Ресурсы
	Движение.Часов								= ВыборкаПоРаботникиОрганизации.ОтработаноЧасов;
КонецПроцедуры // ДобавитьСтрокуВДвиженияПоРегистрамСведений()

Процедура ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаПоТЧ)
	//Аверсон 17.12.2020 КВВ СВФР-006517 (
	Движение = Движения.СостояниеРаботниковОрганизаций.Добавить();
	Движение.Период		= ВыборкаПоТЧ.Дата;
	Движение.ПериодЗавершения = КонецДня(ВыборкаПоТЧ.Дата) + 1;
	// Измерения
	Движение.Сотрудник		= ВыборкаПоТЧ.Сотрудник;
	Движение.Организация	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
	// Ресурсы
	Движение.Состояние		= Перечисления.СостоянияРаботникаОрганизации.ДополнительныеСверхурочныеДни;
	Движение.СостояниеЗавершения	= УчетВремениСвэй.ПолучитьСостояниеСотрудникаНаДату(Организация, ВыборкаПоТЧ.Сотрудник, КонецДня(ВыборкаПоТЧ.Дата) + 60*60*24-1);//Перечисления.СостоянияРаботникаОрганизации.Работает;
	Движение.Регистратор = Ссылка;
	//Аверсон 17.12.2020 КВВ СВФР-006517 )
	
	//Аверсон 25.01.2021 КВВ СВФР-007084 (
	Если ЗначениеЗаполнено(ВыборкаПоТЧ.ДеньОтдыха) Тогда
		Движение = Движения.СостояниеРаботниковОрганизаций.Добавить();
		Движение.Период		= ВыборкаПоТЧ.ДеньОтдыха;
		Движение.ПериодЗавершения = КонецДня(ВыборкаПоТЧ.ДеньОтдыха) + 1;
		// Измерения
		Движение.Сотрудник		= ВыборкаПоТЧ.Сотрудник;
		Движение.Организация	= ВыборкаПоШапкеДокумента.ГоловнаяОрганизация;
		// Ресурсы
		Движение.Состояние		= Перечисления.СостоянияРаботникаОрганизации.ДеньОтдыхаЗаСверхрочные;
		Движение.СостояниеЗавершения	= УчетВремениСвэй.ПолучитьСостояниеСотрудникаНаДату(Организация, ВыборкаПоТЧ.Сотрудник, КонецДня(ВыборкаПоТЧ.Дата) + 60*60*24-1);//Перечисления.СостоянияРаботникаОрганизации.Работает;
		Движение.Регистратор = Ссылка;
	КонецЕсли;
	//Аверсон 25.01.2021 КВВ СВФР-007084 )
	
	//Аверсон 05.11.2021 КВВ СВФР-008344 (
	ЗПроверка = Новый Запрос;
	ЗПроверка.Текст = "ВЫБРАТЬ *
	|ИЗ РегистрСведений.СостояниеРаботниковОрганизаций КАК СостояниеРО
	|ГДЕ СостояниеРО.Сотрудник = &Сотрудник
	|И СостояниеРО.Регистратор <> &Регистратор
	|И (СостояниеРО.Состояние = &Состояние ИЛИ СостояниеРО.Состояние = &Состояние2)
	|И (НАЧАЛОПЕРИОДА(СостояниеРО.Период,ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период,ДЕНЬ) ИЛИ НАЧАЛОПЕРИОДА(СостояниеРО.Период,ДЕНЬ) = НАЧАЛОПЕРИОДА(&Период2,ДЕНЬ))";
	ЗПроверка.УстановитьПараметр("Сотрудник",Движение.Сотрудник);
	ЗПроверка.УстановитьПараметр("Регистратор",Ссылка);
	ЗПроверка.УстановитьПараметр("Состояние",Перечисления.СостоянияРаботникаОрганизации.ДополнительныеСверхурочныеДни);
	ЗПроверка.УстановитьПараметр("Состояние2",Движение.Состояние);
	ЗПроверка.УстановитьПараметр("Период",ВыборкаПоТЧ.Дата);
	ЗПроверка.УстановитьПараметр("Период2",Движение.Период);
	РезЗПроверка = ЗПроверка.Выполнить().Выгрузить();
	Для Каждого СтрРезЗПроверка Из РезЗПроверка Цикл
		
		//Аверсон ЕАЕ 05.08.2025 СВФР-016362
		Если Организация.ИНН = "790041382" Тогда
			Для Каждого Стр Из СтрРезЗПроверка.Регистратор.РаботникиОрганизации Цикл
				Если Стр.Сотрудник <> ВыборкаПоТЧ.Сотрудник Тогда
					Продолжить;
				КонецЕсли;
				Если НачалоДня(Стр.Дата) <> НачалоДня(ВыборкаПоТЧ.Дата) Тогда
					Продолжить;
				КонецЕсли;
				Если НЕ (ВыборкаПоТЧ.ВремяПо < Стр.ВремяС ИЛИ ВыборкаПоТЧ.ВремяС > Стр.ВремяПо) Тогда
					Сообщить("По сотруднику " + ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Движение.Сотрудник.Физлицо) + " на дату " + 
					Формат(Движение.Период, "ДЛФ=Д") + " уже проведен документ " + СтрРезЗПроверка.Регистратор + " (время с " + Формат(Стр.ВремяС, "ДФ=HH:mm:ss") + " по " + Формат(Стр.ВремяПо, "ДФ=HH:mm:ss") + ")");	
				КонецЕсли;
			КонецЦикла;
		Иначе
		//Аверсон СВФР-016362
		
			Сообщить("По сотруднику " + ПроцедурыУправленияПерсоналом.ФамилияИнициалыФизЛица(Движение.Сотрудник.Физлицо) + " на дату " + Формат(Движение.Период, "ДЛФ=Д") + " уже проведен документ " + СтрРезЗПроверка.Регистратор);
		КонецЕсли;
		
	КонецЦикла;
	//Аверсон 05.11.2021 КВВ СВФР-008344 )
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 
		Движения.ВнутрисменноеВремяРаботниковОрганизаций.Записывать = Истина;
		Движения.СостояниеРаботниковОрганизаций.Записывать = Истина; //Аверсон 17.12.2020 КВВ СВФР-006517
	КонецЕсли;
	
	УчетВремениСвэй.УстановитьПоследнегоОтветственногоПоОбъекту(ЭтотОбъект);
	Если РежимЗаписи <> РежимЗаписиДокумента.ОтменаПроведения Тогда 
		КраткийСоставДокумента = ПроцедурыУправленияПерсоналом.ЗаполнитьКраткийСоставДокумента(РаботникиОрганизации, , "ФизЛицо");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УчетВремениСвэй.УстановитьПоследнееЗначениеСчетчика(ЭтотОбъект);

КонецПроцедуры // ПриЗаписи()

Процедура ОбработкаПроведения(Отказ, Режим)

	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);

	РезультатЗапросаПоШапке = СформироватьЗапросПоШапке(Режим);

	// Получим реквизиты шапки из запроса
	ВыборкаПоШапкеДокумента = РезультатЗапросаПоШапке.Выбрать();

	Если ВыборкаПоШапкеДокумента.Следующий() Тогда
		
		//Надо позвать проверку заполнения реквизитов шапки
		ПроверитьЗаполнениеШапки(ВыборкаПоШапкеДокумента, Отказ, Заголовок);
		//проверка на константу
		//ТзПоСверхурочным			    = СформироватьЗапросПоРаботеСверхурочные().Выгрузить();
		//ТзПоСверхурочным.Свернуть("Сотрудник","ОтработаноЧасов");
		//НормаСверхурочных = ?(УчетВремениСвэй.обПустоеЗначение(УчетВремениСвэй.обПолучитьЗначениеКонстантыОбщие(Перечисления.Профит_Константы.НормаСверхурочныхЧасов, КонецДня(Дата))),0,УчетВремениСвэй.обПолучитьЗначениеКонстантыОбщие(Перечисления.Профит_Константы.НормаСверхурочныхЧасов));
		//
		//Если НормаСверхурочных = 0 Тогда
		//	ОбщегоНазначения.СообщитьОбОшибке("Не заполнено значение константы ""Норма сверхурочных часов"" ");
		//КонецЕсли;	
		//
		//Для Каждого СтрокаТЗ Из ТзПоСверхурочным Цикл 
		//	
		//	Если СтрокаТЗ.ОтработаноЧасов > НормаСверхурочных Тогда 
		//		ОбщегоНазначения.СообщитьОбОшибке("Количество отработанных сверхурочных с начала года " + СтрокаТЗ.ОтработаноЧасов +" превышает установленную константу ""Норма сверурочных"" = " + НормаСверхурочных +"! Сотрудник " + СокрЛП(СтрокаТЗ.Сотрудник), Отказ, Заголовок);			
		//	КонецЕсли;
		//КонецЦикла;

		// Движения стоит добавлять, если в проведении еще не отказано (отказ =ложь)
		Если НЕ Отказ Тогда
			
			// выполним выборку по табличной части документа
			РезультатЗапросаПоРаботники	= СформироватьЗапросПоРаботникиОрганизации(ВыборкаПоШапкеДокумента);
			ВыборкаСтрокЗапроса			= РезультатЗапросаПоРаботники.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			// обходим строки запроса, проверяем данные и формируем движения
			Пока ВыборкаСтрокЗапроса.Следующий() Цикл
				
				ПроверитьЗаполнениеСтрокиРаботникаОрганизации(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса , Отказ, Заголовок);
				Если НЕ Отказ Тогда
					
					ДобавитьСтрокуВДвиженияПоРегистрамНакопления(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса);
					ДобавитьСтрокуВДвиженияПоРегистрамСведений(ВыборкаПоШапкеДокумента, ВыборкаСтрокЗапроса);   //Аверсон 17.12.2020 КВВ СВФР-006517
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ОбработкаПроведения()

//Функция СформироватьЗапросПоРаботеСверхурочные()
//	
//	Запрос = Новый Запрос;
//	//Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
//	// Установим параметры запроса
//	Запрос.УстановитьПараметр("ДокументСсылка",	Ссылка);
//	Запрос.УстановитьПараметр("НачалоПериода", НачалоГода(Дата));
//	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
//	Запрос.УстановитьПараметр("Организация", Организация);
//	Запрос.УстановитьПараметр("Сверхурочно",  Справочники.КлассификаторИспользованияРабочегоВремени.Сверхурочные);

//	Запрос.Текст = 
//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Сотрудник,
//	|	СУММА(ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.ОтработаноЧасов) КАК ОтработаноЧасов
//	|ПОМЕСТИТЬ ВТСотрудникиДокумента
//	|ИЗ
//	|	Документ.ПриказОКомпенсацииСверхурочнойРаботы.РаботникиОрганизации КАК ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации
//	|ГДЕ
//	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Ссылка = &ДокументСсылка
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ПриказОКомпенсацииСверхурочнойРаботыРаботникиОрганизации.Сотрудник
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ВнутрисменноеВремяРаботниковОрганизаций.Сотрудник,
//	|	СУММА(ВнутрисменноеВремяРаботниковОрганизаций.Часов) КАК Часов
//	|ПОМЕСТИТЬ ВТРаботаСверхурочно
//	|ИЗ
//	|	РегистрНакопления.ВнутрисменноеВремяРаботниковОрганизаций КАК ВнутрисменноеВремяРаботниковОрганизаций
//	|ГДЕ
//	|	ВнутрисменноеВремяРаботниковОрганизаций.Организация = &Организация
//	|	И ВнутрисменноеВремяРаботниковОрганизаций.Период МЕЖДУ &НачалоПериода И &КонецПериода
//	|	И ВнутрисменноеВремяРаботниковОрганизаций.ВидИспользованияРабочегоВремени = &Сверхурочно
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВнутрисменноеВремяРаботниковОрганизаций.Сотрудник
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ВТСотрудникиДокумента.Сотрудник,
//	|	СУММА(ЕСТЬNULL(ВТСотрудникиДокумента.ОтработаноЧасов, 0) + ЕСТЬNULL(ВТРаботаСверхурочно.Часов, 0)) КАК ОтработаноЧасов
//	|ИЗ
//	|	ВТСотрудникиДокумента КАК ВТСотрудникиДокумента
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРаботаСверхурочно КАК ВТРаботаСверхурочно
//	|		ПО ВТСотрудникиДокумента.Сотрудник = ВТРаботаСверхурочно.Сотрудник
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ВТСотрудникиДокумента.Сотрудник";
//	
//	Возврат Запрос.Выполнить();
//	
//	
//КонецФункции
